finnurtorfa/nrf51/lib/nrf51sdk/Nordic/nrf51822/Source/ble/ble_bondmngr.c
    err_code = ble_flash_page_erase(m_bondmngr_config.flash_page_num_sys_attr);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    
    return NRF_SUCCESS;
}


/**@brief      This function checks if Bonding Information in RAM is different from that in
 *             flash.
 *
 * @return     TRUE if Bonding Information in flash and RAM are different, FALSE otherwise.
 */
static bool bond_info_changed(void)
{
    int      i;
    uint16_t crc = ble_flash_crc16_compute(NULL, 0, NULL);
    
    // Compute CRC for all bonds in database
    for (i = 0; i < m_masters_in_db_count; i++)
    {
        crc = ble_flash_crc16_compute((uint8_t *)&m_masters_db[i].bond,
                                      sizeof(master_bond_t),
                                      &crc);
    }
    
    // Compare to CRC of bonds in flash
    return (crc != m_crc_bond_info);
}


/**@brief      This function checks if System Attributes in RAM is different from that in flash.
 *
 * @return     TRUE if System Attributes in flash and RAM are different, FALSE otherwise.
 */
static bool sys_attr_changed(void)
{
    int      i;
    uint16_t crc = ble_flash_crc16_compute(NULL, 0, NULL);
    
    // Compute CRC for all System Attributes in database
    for (i = 0; i < m_masters_in_db_count; i++)
    {
        crc = ble_flash_crc16_compute((uint8_t *)&m_masters_db[i].sys_attr,
                                      sizeof(master_sys_attr_t),
                                      &crc);
    }
    
    // Compare to CRC of System Attributes in flash with that of the System Attributes in memory.
    return (crc != m_crc_sys_attr);
}


/**@brief      This function sets the System Attributes for specified master to the SoftDevice, or
 *             clears the System Attributes if master is a previously unknown.
 *
 * @param[in]  p_master   Master for which the System Attributes is to be set.
 *
 * @return     NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t master_sys_attr_set(master_t * p_master)
{
    uint8_t * p_sys_attr;
    
    if (m_master.sys_attr.sys_attr_size != 0)
    {
        p_sys_attr = m_master.sys_attr.sys_attr;
    }
    else
    {
        p_sys_attr = NULL;
    }
    
    return sd_ble_gatts_sys_attr_set(m_conn_handle, p_sys_attr, m_master.sys_attr.sys_attr_size);
}


/**@brief This function updates the whitelist data structures.
 */
static void update_whitelist(void)
{
    int i;
    
    for (i = 0, m_addr_count = 0, m_irk_count = 0; i < m_masters_in_db_count; i++)
    {
        master_bond_t * p_bond = &m_masters_db[i].bond;
        
        if (p_bond->auth_status.central_kex.irk)
        {
            m_whitelist_irk[m_irk_count].master_handle = p_bond->master_handle;
            m_whitelist_irk[m_irk_count].p_irk         = &(p_bond->auth_status.central_keys.irk);

            m_irk_count++;
        }
        else
        {
            m_whitelist_addr[m_addr_count].master_handle = p_bond->master_handle;
            m_whitelist_addr[m_addr_count].p_addr        = &(p_bond->master_addr);
                
            m_addr_count++;
        }
    }
}


/**@brief      This function handles the authentication status event related to a new master.
 *
 * @details    This function adds the new master to the database and stores the master's Bonding
 *             Information to flash. It also notifies the application when the new bond is created,
 *             and sets the System Attributes to prepare the stack for connection with the new
 *             master.
 *
 * @param[in]  p_auth_status   New authentication status.
 *
 * @return     NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t on_auth_status_from_new_master(ble_gap_evt_auth_status_t * p_auth_status)
{
    uint32_t err_code;
    
    if (m_masters_in_db_count >= BLE_BONDMNGR_MAX_BONDED_MASTERS)
    {
        return NRF_ERROR_NO_MEM;
    }

    // Update master
    m_master.bond.auth_status        = *p_auth_status;
    m_master.bond.master_id_info.div = p_auth_status->periph_keys.enc_info.div;
    m_master.sys_attr.sys_attr_size  = 0;

    // Add new master to database
    m_master.bond.master_handle           = m_masters_in_db_count;
    m_masters_db[m_masters_in_db_count++] = m_master;
    
    update_whitelist();

    // Clear System Attributes
    err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    
    // Write new master's Bonding Information to flash
    err_code = bond_info_store(&m_master.bond);
    if ((err_code == NRF_ERROR_NO_MEM) && (m_bondmngr_config.evt_handler != NULL))
    {
        ble_bondmngr_evt_t evt;
        
        evt.evt_type      = BLE_BONDMNGR_EVT_BOND_FLASH_FULL;
        evt.master_handle = m_master.bond.master_handle;
        evt.master_id     = m_master.bond.master_id_info.div;
        
        m_bondmngr_config.evt_handler(&evt);
    }
    else if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    
    // Pass event to application
    if (m_bondmngr_config.evt_handler != NULL)
    {
        ble_bondmngr_evt_t evt;
        
        evt.evt_type      = BLE_BONDMNGR_EVT_NEW_BOND;
        evt.master_handle = m_master.bond.master_handle;
        evt.master_id     = m_master.bond.master_id_info.div;
        
        m_bondmngr_config.evt_handler(&evt);
    }
    
    return NRF_SUCCESS;
}


/**@brief This function updates the current master's entry in the database.
 */
static uint32_t master_update(void)
{
    uint32_t err_code;
    int32_t  master_handle = m_master.bond.master_handle;
    
    if ((master_handle >= 0) && (master_handle < m_masters_in_db_count))
    {
        m_masters_db[master_handle] = m_master;
        update_whitelist();

        err_code = NRF_SUCCESS;
    }
    else
    {
        err_code = NRF_ERROR_INTERNAL;
    }

    return err_code;
}


