finnurtorfa/nrf51/lib/nrf51sdk/Nordic/nrf51822/Source/ble/ble_bondmngr.c
/**@brief      This function searches for the master in the database of known masters.
 *
 * @details    If the master is found, the variable m_master will be populated with all the
 *             information (Bonding Information and System Attributes) related to that master.
 *
 * @param[in]  master_id   Master Identifier.
 * @return     NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t master_find_in_db(uint16_t master_id)
{
    int i;
    
    m_master.bond.master_handle = INVALID_MASTER_HANDLE;
    for (i = 0; i < m_masters_in_db_count; i++)
    {
        if (master_id == m_masters_db[i].bond.master_id_info.div)
        {
            m_master = m_masters_db[i];
            return NRF_SUCCESS;
        }
    }
    
    return NRF_ERROR_NOT_FOUND;
}


/**@brief      This function loads all Bonding Information and System Attributes from flash.
 *
 * @return     NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t load_all_from_flash(void)
{
    uint32_t err_code;
    int      i;
    
    // Load bond information for all masters
    m_masters_in_db_count = 0;

    while (m_masters_in_db_count < BLE_BONDMNGR_MAX_BONDED_MASTERS)
    {
        master_bond_t master_bond_info;
        int           master_handle;
        
        // Load Bonding Information
        err_code = bonding_info_load_from_flash(&master_bond_info);
        if (err_code == NRF_ERROR_NOT_FOUND)
        {
            // No more bonds in flash
            break;
        }
        else if (err_code != NRF_SUCCESS)
        {
            return err_code;
        }
        
        master_handle = master_bond_info.master_handle;
        if (master_handle > m_masters_in_db_count)
        {
            // Master handle value(s) missing in flash. This should never happen.
            return NRF_ERROR_INVALID_DATA;
        }
        else
        {
            // Add/update Bonding Information in master array.
            m_masters_db[master_handle].bond = master_bond_info;
            if (master_handle == m_masters_in_db_count)
            {
                // New master handle, clear System Attributes.
                m_masters_db[master_handle].sys_attr.sys_attr_size = 0;
                m_masters_db[master_handle].sys_attr.master_handle = INVALID_MASTER_HANDLE;
                m_masters_in_db_count++;
            }
            else
            {
                // Entry was updated, do nothing
            }
        }
    }

    // Load System Attributes for all previously known masters.
    for (i = 0; i < m_masters_in_db_count; i++)
    {
        master_sys_attr_t master_sys_attr;
        
        // Load System Attributes.
        err_code = sys_attr_load_from_flash(&master_sys_attr);
        if (err_code == NRF_ERROR_NOT_FOUND)
        {
            // No more System Attributes in flash
            break;
        }
        else if (err_code != NRF_SUCCESS)
        {
            return err_code;
        }
        
        if (master_sys_attr.master_handle > m_masters_in_db_count)
        {
            // Master handle value(s) missing in flash. This should never happen.
            return NRF_ERROR_INVALID_DATA;
        }
        else
        {
            // Add/update Bonding Information in master array
            m_masters_db[master_sys_attr.master_handle].sys_attr = master_sys_attr;
        }
    }
    
    // Initialize the remaining empty bond entries in the memory.
    for (i = m_masters_in_db_count; i < BLE_BONDMNGR_MAX_BONDED_MASTERS; i++)
    {
        m_masters_db[i].bond.master_handle     = INVALID_MASTER_HANDLE;
        m_masters_db[i].sys_attr.sys_attr_size = 0;
        m_masters_db[i].sys_attr.master_handle = INVALID_MASTER_HANDLE;
    }
    
    // Update whitelist data structures
    update_whitelist();
    
    return NRF_SUCCESS;
}


/**@brief      This function checks if two variables of type ble_gap_sec_levels_t are equal.
 *
 * @param[in]  p_sec_levels_1   Variable 1.
 * @param[in]  p_sec_levels_2   Variable 2.
 *
 * @return     TRUE if all fields in the two variables are equal, FALSE otherwise.
 */
static bool sec_levels_equal(ble_gap_sec_levels_t * p_sec_levels_1,
                             ble_gap_sec_levels_t * p_sec_levels_2)
{
    return ((p_sec_levels_1->lv1 == p_sec_levels_2->lv1) &&
            (p_sec_levels_1->lv2 == p_sec_levels_2->lv2) &&
            (p_sec_levels_1->lv3 == p_sec_levels_2->lv3));
}


/**@brief      This function checks if two variables of type ble_gap_sec_keys_t are equal.
 *
 * @param[in]  p_sec_keys_1   Variable 1.
 * @param[in]  p_sec_keys_2   Variable 2.
 *
 * @return     TRUE if all fields in the two variables are equal, FALSE otherwise.
 */
static bool sec_keys_equal(ble_gap_sec_keys_t * p_sec_keys_1,
                           ble_gap_sec_keys_t * p_sec_keys_2)
{
    return ((p_sec_keys_1->ltk       == p_sec_keys_2->ltk)       &&
            (p_sec_keys_1->ediv_rand == p_sec_keys_2->ediv_rand) &&
            (p_sec_keys_1->irk       == p_sec_keys_2->irk)       &&
            (p_sec_keys_1->address   == p_sec_keys_2->address)   &&
            (p_sec_keys_1->csrk      == p_sec_keys_2->csrk));
}


/**@brief      This function checks if two variables of type ble_gap_enc_info_t are equal.
 *
 * @param[in]  p_enc_info_1   Variable 1.
 * @param[in]  p_enc_info_2   Variable 2.
 *
 * @return     TRUE if all fields in the two variables are equal, FALSE otherwise.
 */
static bool enc_info_equal(ble_gap_enc_info_t * p_enc_info_1,
                           ble_gap_enc_info_t * p_enc_info_2)
{
    return ((p_enc_info_1->div     == p_enc_info_2->div)     &&
            (p_enc_info_1->auth    == p_enc_info_2->auth)    &&
            (p_enc_info_1->ltk_len == p_enc_info_2->ltk_len) &&
            (memcmp(p_enc_info_1->ltk, p_enc_info_2->ltk, p_enc_info_1->ltk_len) == 0));
}


/**@brief      This function checks if two variables of type ble_gap_irk_t are equal.
 *
 * @param[in]  p_irk_1   Variable 1.
 * @param[in]  p_irk_2   Variable 2.
 *
 * @return     TRUE if all fields in the two variables are equal, FALSE otherwise.
 */
static bool irk_equal(ble_gap_irk_t * p_irk_1,
                      ble_gap_irk_t * p_irk_2)
{
    return (memcmp(p_irk_1->irk, p_irk_2->irk, BLE_GAP_SEC_KEY_LEN) == 0);
}


