finnurtorfa/nrf51/lib/nrf51sdk/Nordic/nrf51822/Source/ble/ble_bondmngr.c
/**@brief      This function checks if two variables of type ble_gap_addr_t are equal.
 *
 * @param[in]  p_addr_1   Variable 1.
 * @param[in]  p_addr_2   Variable 2.
 *
 * @return     TRUE if all fields in the two variables are equal, FALSE otherwise.
 */
static bool addr_equal(ble_gap_addr_t * p_addr_1,
                       ble_gap_addr_t * p_addr_2)
{
    return ((p_addr_1->addr_type == p_addr_2->addr_type) &&
            (memcmp(p_addr_1->addr, p_addr_2->addr, BLE_GAP_ADDR_LEN) == 0));
}


/**@brief      This function checks if two variables of type ble_gap_evt_auth_status_t are equal.
 *
 * @param[in]  p_auth_status_1   Variable 1.
 * @param[in]  p_auth_status_2   Variable 2.
 *
 * @return     TRUE if all fields in the two variables are equal, FALSE otherwise.
 */
static bool auth_status_equal(ble_gap_evt_auth_status_t * p_auth_status_1,
                              ble_gap_evt_auth_status_t * p_auth_status_2)
{
    return ((p_auth_status_1->auth_status == p_auth_status_2->auth_status)                    &&
            (p_auth_status_1->error_src   == p_auth_status_2->error_src)                      &&
            sec_levels_equal(&p_auth_status_1->sm1_levels, &p_auth_status_2->sm1_levels)      &&
            sec_levels_equal(&p_auth_status_1->sm2_levels, &p_auth_status_2->sm2_levels)      &&
            sec_keys_equal(&p_auth_status_1->periph_kex, &p_auth_status_2->periph_kex)        &&
            sec_keys_equal(&p_auth_status_1->central_kex, &p_auth_status_2->central_kex)      &&
            enc_info_equal(&p_auth_status_1->periph_keys.enc_info,
                           &p_auth_status_2->periph_keys.enc_info)                            &&
            irk_equal(&p_auth_status_1->central_keys.irk, &p_auth_status_2->central_keys.irk) &&
            addr_equal(&p_auth_status_1->central_keys.id_info,
                       &p_auth_status_2->central_keys.id_info));
}


/**@brief      This function handles the connected event received from the BLE stack.
 *
 * @param[in]  p_ble_evt   Event received from the BLE stack.
 */
static void on_connect(ble_evt_t * p_ble_evt)
{
    m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
    
    m_master.bond.master_handle     = INVALID_MASTER_HANDLE;
    m_master.bond.master_addr       = p_ble_evt->evt.gap_evt.params.connected.peer_addr;
    m_master.sys_attr.sys_attr_size = 0;

    if (p_ble_evt->evt.gap_evt.params.connected.irk_match)
    {
        uint8_t irk_idx  = p_ble_evt->evt.gap_evt.params.connected.irk_match_idx;
        
        if ((irk_idx >= MAX_NUM_MASTER_WHITE_LIST) ||
            (m_whitelist_irk[irk_idx].master_handle >= BLE_BONDMNGR_MAX_BONDED_MASTERS))
        {
            m_bondmngr_config.error_handler(NRF_ERROR_INTERNAL);
        }
        else
        {
            m_master = m_masters_db[m_whitelist_irk[irk_idx].master_handle];
        }
    }
    else
    {
        int i;
        
        for (i = 0; i < m_addr_count; i++)
        {
            ble_gap_addr_t * p_cur_addr = m_whitelist_addr[i].p_addr;
            
            if (memcmp(p_cur_addr->addr, m_master.bond.master_addr.addr, BLE_GAP_ADDR_LEN) == 0)
            {
                m_master = m_masters_db[m_whitelist_addr[i].master_handle];
                break;
            }
        }
    }

    if (m_master.bond.master_handle != INVALID_MASTER_HANDLE)
    {
        uint32_t err_code = master_sys_attr_set(&m_master);
        if (err_code != NRF_SUCCESS)
        {
            m_bondmngr_config.error_handler(err_code);
        }
        
        if (m_bondmngr_config.evt_handler != NULL)
        {
            ble_bondmngr_evt_t evt;
            
            evt.evt_type      = BLE_BONDMNGR_EVT_CONN_TO_BONDED_MASTER;
            evt.master_handle = m_master.bond.master_handle;
            evt.master_id     = m_master.bond.master_id_info.div;
            
            m_bondmngr_config.evt_handler(&evt);
        }
    }
}


/**@brief      This function handles the 'System Attributes Missing' event received from the
 *             SoftDevice.
 *
 * @param[in]  p_ble_evt   Event received from the BLE stack.
 */
static void on_sys_attr_missing(ble_evt_t * p_ble_evt)
{
    uint32_t err_code;
    
    if (m_master.bond.master_handle == INVALID_MASTER_HANDLE)
    {
        err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0);
    }
    else
    {
        // Current master is valid, use its data. Set the corresponding sys_attr.
        err_code = master_sys_attr_set(&m_master);
    }

    if (err_code != NRF_SUCCESS)
    {
        m_bondmngr_config.error_handler(err_code);
    }
}


/**@brief      This function handles the new authentication status event, received from the
 *             SoftDevice, related to an already bonded master.
 *
 * @details    This function also writes the updated Bonding Information to flash and notifies the
 *             application.
 *
 * @param[in]  p_auth_status   Updated authentication status.
 */
static void auth_status_update(ble_gap_evt_auth_status_t * p_auth_status)
{
    if (!auth_status_equal(&m_master.bond.auth_status, p_auth_status))
    {
        uint32_t err_code;

        // Authentication status changed, update Bonding Information
        m_master.bond.auth_status        = *p_auth_status;
        m_master.bond.master_id_info.div = p_auth_status->periph_keys.enc_info.div;
        
        // Write updated Bonding Information to flash
        err_code = bond_info_store(&m_master.bond);
        if ((err_code == NRF_ERROR_NO_MEM) && (m_bondmngr_config.evt_handler != NULL))
        {
            ble_bondmngr_evt_t evt;
            
            evt.evt_type      = BLE_BONDMNGR_EVT_BOND_FLASH_FULL;
            evt.master_handle = m_master.bond.master_handle;
            evt.master_id     = m_master.bond.master_id_info.div;
            
            m_bondmngr_config.evt_handler(&evt);
        }
        else if (err_code != NRF_SUCCESS)
        {
            m_bondmngr_config.error_handler(err_code);
        }
        
        // Pass event to the application
        if (m_bondmngr_config.evt_handler != NULL)
        {
            ble_bondmngr_evt_t evt;
        
            evt.evt_type      = BLE_BONDMNGR_EVT_AUTH_STATUS_UPDATED;
            evt.master_handle = m_master.bond.master_handle;
            evt.master_id     = m_master.bond.master_id_info.div;
            
            m_bondmngr_config.evt_handler(&evt);
        }
    }
}


/**@brief      This function handles the Authentication Status event received from the BLE stack.
 *
 * @param[in]  p_ble_evt   Event received from the BLE stack.
 */
static void on_auth_status(ble_gap_evt_auth_status_t * p_auth_status)
{
    if (p_auth_status->auth_status != BLE_GAP_SEC_STATUS_SUCCESS)
    {
        return;
    }
    
    if (m_master.bond.master_handle == INVALID_MASTER_HANDLE)
    {
        uint32_t err_code = master_find_in_db(p_auth_status->periph_keys.enc_info.div);
        
        switch (err_code)
        {
            case NRF_SUCCESS:
                // Master found in the list of bonded masters. Set the corresponding sys_attr.
                err_code = master_sys_attr_set(&m_master);
                break;
                
